/** @file

;******************************************************************************
;* Copyright (c) 2014, Insyde Software Corp. All Rights Reserved.
;*
;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
;* transmit, broadcast, present, recite, release, license or otherwise exploit
;* any part of this publication in any form, by any means, without the prior
;* written permission of Insyde Software Corporation.
;*
;******************************************************************************
*/

/=#
//
// Form 0x30: SATA Configuration
//
#string STR_SATA_P0_HOT_PLUG_STRING     #language en-US        "SATA Port 0 - HotPlug"
                                        #language fr-FR        "SATA Port 0 - HotPlug"
                                        #language it-IT        "Porta SATA 0 - HotPlug"
                                        #language es-ES        "Porta SATA 0 - Enchufe Caliente"
                                        #language de-DE        "SATA Port 0 - Heißer Stecker"
                                        #language pt-PT        "Porta SATA 0 - Tomada Quente"
#string STR_SATA_P0_HOT_PLUG_HELP       #language en-US        "Enable/Disable SATA Port 0 HotPlug"
                                        #language fr-FR        "Activer/Désactiver SATA Port 0 HotPlug"
                                        #language it-IT        "Abilitare/Disabilitare Porta SATA 0 HotPlug"
                                        #language es-ES        "Permita/Inhabilite Porta SATA 0 Enchufe Caliente"
                                        #language de-DE        "Aktivieren/Sperren SATA Port 0 Heißer Stecker"
                                        #language pt-PT        "Aprovar/Desaprovar Porta SATA 0 Tomada Quente"
#string STR_SATA_P1_HOT_PLUG_STRING     #language en-US        "SATA Port 1 - HotPlug"
                                        #language fr-FR        "SATA Port 1 - HotPlug"
                                        #language it-IT        "Porta SATA 1 - HotPlug"
                                        #language es-ES        "Porta SATA 1 - Enchufe Caliente"
                                        #language de-DE        "SATA Port 1 - Heißer Stecker"
                                        #language pt-PT        "Porta SATA 1 - Tomada Quente"
#string STR_SATA_P1_HOT_PLUG_HELP       #language en-US        "Enable/Disable SATA Port 1 HotPlug"
                                        #language fr-FR        "Activer/Désactiver SATA Port 1 HotPlug"
                                        #language it-IT        "Abilitare/Disabilitare Porta SATA 1 HotPlug"
                                        #language es-ES        "Permita/Inhabilite Porta SATA 1 Enchufe Caliente"
                                        #language de-DE        "Aktivieren/Sperren SATA Port 1 Heißer Stecker"
                                        #language pt-PT        "Aprovar/Desaprovar Porta SATA 1 Tomada Quente"
#string STR_SATA_P2_HOT_PLUG_STRING     #language en-US        "SATA Port 2 - HotPlug"
                                        #language fr-FR        "SATA Port 2 - HotPlug"
                                        #language it-IT        "Porta SATA 2 - HotPlug"
                                        #language es-ES        "Porta SATA 2 - Enchufe Caliente"
                                        #language de-DE        "SATA Port 2 - Heißer Stecker"
                                        #language pt-PT        "Porta SATA 2 - Tomada Quente"
#string STR_SATA_P2_HOT_PLUG_HELP       #language en-US        "Enable/Disable SATA Port 2 HotPlug"
                                        #language fr-FR        "Activer/Désactiver SATA Port 2 HotPlug"
                                        #language it-IT        "Abilitare/Disabilitare Porta SATA 2 HotPlug"
                                        #language es-ES        "Permita/Inhabilite Porta SATA 2 Enchufe Caliente"
                                        #language de-DE        "Aktivieren/Sperren SATA Port 2 Heißer Stecker"
                                        #language pt-PT        "Aprovar/Desaprovar Porta SATA 2 Tomada Quente"
#string STR_SATA_P3_HOT_PLUG_STRING     #language en-US        "SATA Port 3 - HotPlug"
                                        #language fr-FR        "SATA Port 3 - HotPlug"
                                        #language it-IT        "Porta SATA 3 - HotPlug"
                                        #language es-ES        "Porta SATA 3 - Enchufe Caliente"
                                        #language de-DE        "SATA Port 3 - Heißer Stecker"
                                        #language pt-PT        "Porta SATA 3 - Tomada Quente"
#string STR_SATA_P3_HOT_PLUG_HELP       #language en-US        "Enable/Disable SATA Port 3 HotPlug"
                                        #language fr-FR        "Activer/Désactiver SATA Port 3 HotPlug"
                                        #language it-IT        "Abilitare/Disabilitare Porta SATA 3 HotPlug"
                                        #language es-ES        "Permita/Inhabilite Porta SATA 3 Enchufe Caliente"
                                        #language de-DE        "Aktivieren/Sperren SATA Port 3 Heißer Stecker"
                                        #language pt-PT        "Aprovar/Desaprovar Porta SATA 3 Tomada Quente"
#string STR_SATA_P4_HOT_PLUG_STRING     #language en-US        "SATA Port 4 - HotPlug"
                                        #language fr-FR        "SATA Port 4 - HotPlug"
                                        #language it-IT        "Porta SATA 4 - HotPlug"
                                        #language es-ES        "Porta SATA 4 - Enchufe Caliente"
                                        #language de-DE        "SATA Port 4 - Heißer Stecker"
                                        #language pt-PT        "Porta SATA 4 - Tomada Quente"
#string STR_SATA_P4_HOT_PLUG_HELP       #language en-US        "Enable/Disable SATA Port 4 HotPlug"
                                        #language fr-FR        "Activer/Désactiver SATA Port 4 HotPlug"
                                        #language it-IT        "Abilitare/Disabilitare Porta SATA 4 HotPlug"
                                        #language es-ES        "Permita/Inhabilite Porta SATA 4 Enchufe Caliente"
                                        #language de-DE        "Aktivieren/Sperren SATA Port 4 Heißer Stecker"
                                        #language pt-PT        "Aprovar/Desaprovar Porta SATA 4 Tomada Quente"
#string STR_SATA_P5_HOT_PLUG_STRING     #language en-US        "SATA Port 5 - HotPlug"
                                        #language fr-FR        "SATA Port 5 - HotPlug"
                                        #language it-IT        "Porta SATA 5 - HotPlug"
                                        #language es-ES        "Porta SATA 5 - Enchufe Caliente"
                                        #language de-DE        "SATA Port 5 - Heißer Stecker"
                                        #language pt-PT        "Porta SATA 5 - Tomada Quente"
#string STR_SATA_P5_HOT_PLUG_HELP       #language en-US        "Enable/Disable SATA Port 5 HotPlug"
                                        #language fr-FR        "Activer/Désactiver SATA Port 5 HotPlug"
                                        #language it-IT        "Abilitare/Disabilitare Porta SATA 5 HotPlug"
                                        #language es-ES        "Permita/Inhabilite Porta SATA 5 Enchufe Caliente"
                                        #language de-DE        "Aktivieren/Sperren SATA Port 5 Heißer Stecker"
                                        #language pt-PT        "Aprovar/Desaprovar Porta SATA 5 Tomada Quente"
#string STR_SATA_SPIN_UP_DEVICE_STRING  #language en-US        "            - Spin Up"
                                        #language fr-FR        "            - Spin Up"
                                        #language it-IT        "             - Spin Up"
                                        #language es-ES        "             - Spin Up"
                                        #language de-DE        "            - Spin Up"
                                        #language pt-PT        "             - Spin Up"
#string STR_SATA_SPIN_UP_DEVICE_HELP    #language en-US        "On an edge detect from 0 to 1, the PCH starts a COMRESET initialization sequence to the device."
                                        #language fr-FR        "On an edge detect from 0 to 1, the PCH starts a COMRESET initialization sequence to the device."
                                        #language it-IT        "On an edge detect from 0 to 1, the PCH starts a COMRESET initialization sequence to the device."
                                        #language es-ES        "On an edge detect from 0 to 1, the PCH starts a COMRESET initialization sequence to the device."
                                        #language de-DE        "On an edge detect from 0 to 1, the PCH starts a COMRESET initialization sequence to the device."
                                        #language pt-PT        "On an edge detect from 0 to 1, the PCH starts a COMRESET initialization sequence to the device."
#string STR_SATA_P0_INTER_LOCK_SWITCH_STRING    #language en-US        "SATA Port 0 ILS"
                                                #language fr-FR        "SATA Port 0 ILS"
                                                #language it-IT        "Porta SATA 0 ILS"
                                                #language es-ES        "Porta SATA 0 ILS"
                                                #language de-DE        "SATA Port 0 ILSSATA Port 0 ILS"
                                                #language pt-PT        "Porta SATA 0 ILS"
#string STR_SATA_P0_INTER_LOCK_SWITCH_HELP      #language en-US        "Enable/Disable SATA Port 0 InterLock Switch"
                                                #language fr-FR        "EActiver/Désactiver SATA Port 0 Interlock Contact"
                                                #language it-IT        "Abilitare/Disabilitare Porta SATA 0 Selettore InterLock"
                                                #language es-ES        "Permita/Inhabilite Porta SATA 0 Interruptor de Interlock"
                                                #language de-DE        "Aktivieren/Sperren SATA Port 0 Sicherheitsschalter"
                                                #language pt-PT        "Aprovar/Desaprovar Porta SATA 0 Interruptor de InterTrancar"
#string STR_SATA_P1_INTER_LOCK_SWITCH_STRING    #language en-US        "SATA Port 1 ILS"
                                                #language fr-FR        "SATA Port 1 ILS"
                                                #language it-IT        "Porta SATA 1 ILS"
                                                #language es-ES        "Porta SATA 1 ILS"
#string STR_SATA_P1_INTER_LOCK_SWITCH_HELP      #language en-US        "Enable/Disable SATA Port 1 InterLock Switch"
                                                #language fr-FR        "Enable/Disable SATA Port 1 InterLock Switch"
                                                #language it-IT        "Abilitare/Disabilitare Porta SATA 1 Selettore InterLock"
                                                #language es-ES        "Permita/Inhabilite Porta SATA 1 Interruptor de Interlock"
#string STR_SATA_P2_INTER_LOCK_SWITCH_STRING    #language en-US        "SATA Port 2 ILS"
                                                #language fr-FR        "SATA Port 2 ILS"
                                                #language it-IT        "Porta SATA 2 ILS"
                                                #language es-ES        "Permita/Inhabilite Porta SATA 0 Interruptor de Interlock"
                                                #language de-DE        "SATA Port 2 ILS"
                                                #language pt-PT        "Porta SATA 2 ILS"
#string STR_SATA_P2_INTER_LOCK_SWITCH_HELP      #language en-US        "Enable/Disable SATA Port 2 InterLock Switch"
                                                #language fr-FR        "Activer/Désactiver SATA Port 2 Interlock Contact"
                                                #language it-IT        "Abilitare/Disabilitare Porta SATA 2 Selettore InterLock"
                                                #language es-ES        "Permita/Inhabilite Porta SATA 2 Interruptor de Interlock"
                                                #language de-DE        "Aktivieren/Sperren SATA Port 2 Sicherheitsschalter"
                                                #language pt-PT        "Aprovar/Desaprovar Porta SATA 2 Interruptor de InterTrancar"
//
//  Sub Form 0x230~0x237 IDE device setting.
//
#string STR_SERIAL_ATA_PORT0_STRING         #language en-US        "Serial ATA Port 0       "
                                            #language fr-FR        "Serial ATA Port 0       "
                                            #language zh-TW        "Serial ATA Port 0       "
                                            #language ja-JP        "Serial ATA Port 0       "
                                            #language it-IT        "Serial ATA Port 0       "
                                            #language es-ES        "Serial ATA Port 0       "
                                            #language de-DE        "Serial ATA Port 0       "
                                            #language pt-PT        "Serial ATA Port 0       "
#string STR_SERIAL_ATA_PORT1_STRING         #language en-US        "Serial ATA Port 1       "
                                            #language fr-FR        "Serial ATA Port 1       "
                                            #language zh-TW        "Serial ATA Port 1       "
                                            #language ja-JP        "Serial ATA Port 1       "
                                            #language it-IT        "Serial ATA Port 1       "
                                            #language es-ES        "Serial ATA Port 1       "
                                            #language de-DE        "Serial ATA Port 1       "
                                            #language pt-PT        "Serial ATA Port 1       "
#string STR_SERIAL_ATA_PORT2_STRING         #language en-US        "Serial ATA Port 2       "
                                            #language fr-FR        "Serial ATA Port 2       "
                                            #language zh-TW        "Serial ATA Port 2       "
                                            #language ja-JP        "Serial ATA Port 2       "
                                            #language it-IT        "Serial ATA Port 2       "
                                            #language es-ES        "Serial ATA Port 2       "
                                            #language de-DE        "Serial ATA Port 2       "
                                            #language pt-PT        "Serial ATA Port 2       "
#string STR_SERIAL_ATA_PORT3_STRING         #language en-US        "Serial ATA Port 3       "
                                            #language fr-FR        "Serial ATA Port 3       "
                                            #language zh-TW        "Serial ATA Port 3       "
                                            #language ja-JP        "Serial ATA Port 3       "
                                            #language it-IT        "Serial ATA Port 3       "
                                            #language es-ES        "Serial ATA Port 3       "
                                            #language de-DE        "Serial ATA Port 3       "
                                            #language pt-PT        "Serial ATA Port 3       "
#string STR_SERIAL_ATA_PORT4_STRING         #language en-US        "Serial ATA Port 4       "
                                            #language fr-FR        "Serial ATA Port 4       "
                                            #language zh-TW        "Serial ATA Port 4       "
                                            #language ja-JP        "Serial ATA Port 4       "
                                            #language it-IT        "Serial ATA Port 4       "
                                            #language es-ES        "Serial ATA Port 4       "
                                            #language de-DE        "Serial ATA Port 4       "
                                            #language pt-PT        "Serial ATA Port 4       "
#string STR_SERIAL_ATA_PORT5_STRING         #language en-US        "Serial ATA Port 5       "
                                            #language fr-FR        "Serial ATA Port 5       "
                                            #language zh-TW        "Serial ATA Port 5       "
                                            #language ja-JP        "Serial ATA Port 5       "
                                            #language it-IT        "Serial ATA Port 5       "
                                            #language es-ES        "Serial ATA Port 5       "
                                            #language de-DE        "Serial ATA Port 5       "
                                            #language pt-PT        "Serial ATA Port 5       "
#string STR_SERIAL_ATA_PORT6_STRING         #language en-US        "Serial ATA Port 6       "
                                            #language fr-FR        "Serial ATA Port 6       "
                                            #language zh-TW        "Serial ATA Port 6       "
                                            #language ja-JP        "Serial ATA Port 6       "
                                            #language it-IT        "Serial ATA Port 6       "
                                            #language es-ES        "Serial ATA Port 6       "
                                            #language de-DE        "Serial ATA Port 6       "
                                            #language pt-PT        "Serial ATA Port 6       "
#string STR_SERIAL_ATA_PORT7_STRING         #language en-US        "Serial ATA Port 7       "
                                            #language fr-FR        "Serial ATA Port 7       "
                                            #language zh-TW        "Serial ATA Port 7       "
                                            #language ja-JP        "Serial ATA Port 7       "
                                            #language it-IT        "Serial ATA Port 7       "
                                            #language es-ES        "Serial ATA Port 7       "
                                            #language de-DE        "Serial ATA Port 7       "
                                            #language pt-PT        "Serial ATA Port 7       "
#string STR_SERIAL_ATA_PORT0_STRING_HELP    #language en-US        "Serial ATA Port 0 Device configuration"
                                            #language fr-FR        "Serial ATA Port 0 Device configuration"
                                            #language zh-TW        "Serial ATA Port 0 Device configuration"
                                            #language ja-JP        "Serial ATA Port 0 Device configuration"
                                            #language it-IT        "Serial ATA Port 0 Device configuration"
                                            #language es-ES        "Serial ATA Port 0 Device configuration"
                                            #language de-DE        "Serial ATA Port 0 Device configuration"
                                            #language pt-PT        "Serial ATA Port 0 Device configuration"
#string STR_SERIAL_ATA_PORT1_STRING_HELP    #language en-US        "Serial ATA Port 1 Device configuration"
                                            #language fr-FR        "Serial ATA Port 1 Device configuration"
                                            #language zh-TW        "Serial ATA Port 1 Device configuration"
                                            #language ja-JP        "Serial ATA Port 1 Device configuration"
                                            #language it-IT        "Serial ATA Port 1 Device configuration"
                                            #language es-ES        "Serial ATA Port 1 Device configuration"
                                            #language de-DE        "Serial ATA Port 1 Device configuration"
                                            #language pt-PT        "Serial ATA Port 1 Device configuration"
#string STR_SERIAL_ATA_PORT2_STRING_HELP    #language en-US        "Serial ATA Port 2 Device configuration"
                                            #language fr-FR        "Serial ATA Port 2 Device configuration"
                                            #language zh-TW        "Serial ATA Port 2 Device configuration"
                                            #language ja-JP        "Serial ATA Port 2 Device configuration"
                                            #language it-IT        "Serial ATA Port 2 Device configuration"
                                            #language es-ES        "Serial ATA Port 2 Device configuration"
                                            #language de-DE        "Serial ATA Port 2 Device configuration"
                                            #language pt-PT        "Serial ATA Port 2 Device configuration"
#string STR_SERIAL_ATA_PORT3_STRING_HELP    #language en-US        "Serial ATA Port 3 Device configuration"
                                            #language fr-FR        "Serial ATA Port 3 Device configuration"
                                            #language zh-TW        "Serial ATA Port 3 Device configuration"
                                            #language ja-JP        "Serial ATA Port 3 Device configuration"
                                            #language it-IT        "Serial ATA Port 3 Device configuration"
                                            #language es-ES        "Serial ATA Port 3 Device configuration"
                                            #language de-DE        "Serial ATA Port 3 Device configuration"
                                            #language pt-PT        "Serial ATA Port 3 Device configuration"
#string STR_SERIAL_ATA_PORT4_STRING_HELP    #language en-US        "Serial ATA Port 4 Device configuration"
                                            #language fr-FR        "Serial ATA Port 4 Device configuration"
                                            #language zh-TW        "Serial ATA Port 4 Device configuration"
                                            #language ja-JP        "Serial ATA Port 4 Device configuration"
                                            #language it-IT        "Serial ATA Port 4 Device configuration"
                                            #language es-ES        "Serial ATA Port 4 Device configuration"
                                            #language de-DE        "Serial ATA Port 4 Device configuration"
                                            #language pt-PT        "Serial ATA Port 4 Device configuration"
#string STR_SERIAL_ATA_PORT5_STRING_HELP    #language en-US        "Serial ATA Port 5 Device configuration"
                                            #language fr-FR        "Serial ATA Port 5 Device configuration"
                                            #language zh-TW        "Serial ATA Port 5 Device configuration"
                                            #language ja-JP        "Serial ATA Port 5 Device configuration"
                                            #language it-IT        "Serial ATA Port 5 Device configuration"
                                            #language es-ES        "Serial ATA Port 5 Device configuration"
                                            #language de-DE        "Serial ATA Port 5 Device configuration"
                                            #language pt-PT        "Serial ATA Port 5 Device configuration"
#string STR_SERIAL_ATA_PORT6_STRING_HELP    #language en-US        "Serial ATA Port 6 Device configuration"
                                            #language fr-FR        "Serial ATA Port 6 Device configuration"
                                            #language zh-TW        "Serial ATA Port 6 Device configuration"
                                            #language ja-JP        "Serial ATA Port 6 Device configuration"
                                            #language it-IT        "Serial ATA Port 6 Device configuration"
                                            #language es-ES        "Serial ATA Port 6 Device configuration"
                                            #language de-DE        "Serial ATA Port 6 Device configuration"
                                            #language pt-PT        "Serial ATA Port 6 Device configuration"
#string STR_SERIAL_ATA_PORT7_STRING_HELP    #language en-US        "Serial ATA Port 7 Device configuration"
                                            #language fr-FR        "Serial ATA Port 7 Device configuration"
                                            #language zh-TW        "Serial ATA Port 7 Device configuration"
                                            #language ja-JP        "Serial ATA Port 7 Device configuration"
                                            #language it-IT        "Serial ATA Port 7 Device configuration"
                                            #language es-ES        "Serial ATA Port 7 Device configuration"
                                            #language de-DE        "Serial ATA Port 7 Device configuration"
                                            #language pt-PT        "Serial ATA Port 7 Device configuration"
#string STR_SERIAL_ATA_PORT0_MODEL_NAME     #language en-US        "Serial ATA Port 0       "
                                            #language fr-FR        "Serial ATA Port 0       "
                                            #language zh-TW        "Serial ATA Port 0       "
                                            #language ja-JP        "Serial ATA Port 0       "
                                            #language it-IT        "Serial ATA Port 0       "
                                            #language es-ES        "Serial ATA Port 0       "
                                            #language de-DE        "Serial ATA Port 0       "
                                            #language pt-PT        "Serial ATA Port 0       "
#string STR_SERIAL_ATA_PORT1_MODEL_NAME     #language en-US        "Serial ATA Port 1       "
                                            #language fr-FR        "Serial ATA Port 1       "
                                            #language zh-TW        "Serial ATA Port 1       "
                                            #language ja-JP        "Serial ATA Port 1       "
                                            #language it-IT        "Serial ATA Port 1       "
                                            #language es-ES        "Serial ATA Port 1       "
                                            #language de-DE        "Serial ATA Port 1       "
                                            #language pt-PT        "Serial ATA Port 1       "
#string STR_SERIAL_ATA_PORT2_MODEL_NAME     #language en-US        "Serial ATA Port 2       "
                                            #language fr-FR        "Serial ATA Port 2       "
                                            #language zh-TW        "Serial ATA Port 2       "
                                            #language ja-JP        "Serial ATA Port 2       "
                                            #language it-IT        "Serial ATA Port 2       "
                                            #language es-ES        "Serial ATA Port 2       "
                                            #language de-DE        "Serial ATA Port 2       "
                                            #language pt-PT        "Serial ATA Port 2       "
#string STR_SERIAL_ATA_PORT3_MODEL_NAME     #language en-US        "Serial ATA Port 3       "
                                            #language fr-FR        "Serial ATA Port 3       "
                                            #language zh-TW        "Serial ATA Port 3       "
                                            #language ja-JP        "Serial ATA Port 3       "
                                            #language it-IT        "Serial ATA Port 3       "
                                            #language es-ES        "Serial ATA Port 3       "
                                            #language de-DE        "Serial ATA Port 3       "
                                            #language pt-PT        "Serial ATA Port 3       "
#string STR_SERIAL_ATA_PORT4_MODEL_NAME     #language en-US        "Serial ATA Port 4       "
                                            #language fr-FR        "Serial ATA Port 4       "
                                            #language zh-TW        "Serial ATA Port 4       "
                                            #language ja-JP        "Serial ATA Port 4       "
                                            #language it-IT        "Serial ATA Port 4       "
                                            #language es-ES        "Serial ATA Port 4       "
                                            #language de-DE        "Serial ATA Port 4       "
                                            #language pt-PT        "Serial ATA Port 4       "
#string STR_SERIAL_ATA_PORT5_MODEL_NAME     #language en-US        "Serial ATA Port 5       "
                                            #language fr-FR        "Serial ATA Port 5       "
                                            #language zh-TW        "Serial ATA Port 5       "
                                            #language ja-JP        "Serial ATA Port 5       "
                                            #language it-IT        "Serial ATA Port 5       "
                                            #language es-ES        "Serial ATA Port 5       "
                                            #language de-DE        "Serial ATA Port 5       "
                                            #language pt-PT        "Serial ATA Port 5       "
#string STR_SERIAL_ATA_PORT6_MODEL_NAME     #language en-US        "Serial ATA Port 6       "
                                            #language fr-FR        "Serial ATA Port 6       "
                                            #language zh-TW        "Serial ATA Port 6       "
                                            #language ja-JP        "Serial ATA Port 6       "
                                            #language it-IT        "Serial ATA Port 6       "
                                            #language es-ES        "Serial ATA Port 6       "
                                            #language de-DE        "Serial ATA Port 6       "
                                            #language pt-PT        "Serial ATA Port 6       "
#string STR_SERIAL_ATA_PORT7_MODEL_NAME     #language en-US        "Serial ATA Port 7       "
                                            #language fr-FR        "Serial ATA Port 7       "
                                            #language zh-TW        "Serial ATA Port 7       "
                                            #language ja-JP        "Serial ATA Port 7       "
                                            #language it-IT        "Serial ATA Port 7       "
                                            #language es-ES        "Serial ATA Port 7       "
                                            #language de-DE        "Serial ATA Port 7       "
                                            #language pt-PT        "Serial ATA Port 7       "
#string STR_IDE_MASTER_TRANSFER_BASTER_MODE #language en-US       "Master Best Mode"
                                            #language fr-FR       "Mode Meillieure Master"
                                            #language it-IT       "Miglior modalita` principale"
                                            #language es-ES       "Modo Principal Mejor"
                                            #language de-DE       "Master bester Modus"
                                            #language pt-PT       "Mestre Melhor Modo"
#string STR_IDE_SLAVE_TRANSFER_BASTER_MODE  #language en-US       "Slave Best Mode"
                                            #language fr-FR       "Mode Meillieure Slave"
                                            #language it-IT       "Miglior modalita` slave"
                                            #language es-ES       "Modo Esclavo Mejor"
                                            #language de-DE       "Untergeordnete bester Modus"
                                            #language pt-PT       "Escrovo Melhor Modo"
#string STR_SERIAL_ATA_PORT0_TRANSFER_MODE  #language en-US       "Serial ATA Best Mode"
                                            #language fr-FR       "Serial ATA Best Mode"
                                            #language zh-TW       "Serial ATA Best Mode"
                                            #language ja-JP       "Serial ATA Best Mode"
                                            #language it-IT       "Serial ATA Best Mode"
                                            #language es-ES       "Serial ATA Best Mode"
                                            #language de-DE       "Serial ATA Best Mode"
                                            #language pt-PT       "Serial ATA Best Mode"
#string STR_SERIAL_ATA_PORT1_TRANSFER_MODE  #language en-US       "Serial ATA Best Mode"
                                            #language fr-FR       "Serial ATA Best Mode"
                                            #language zh-TW       "Serial ATA Best Mode"
                                            #language ja-JP       "Serial ATA Best Mode"
                                            #language it-IT       "Serial ATA Best Mode"
                                            #language es-ES       "Serial ATA Best Mode"
                                            #language de-DE       "Serial ATA Best Mode"
                                            #language pt-PT       "Serial ATA Best Mode"
#string STR_SERIAL_ATA_PORT0_SECURITY_MODE  #language en-US       "Uninstall"
                                            #language fr-FR       "Uninstalle"
                                            #language zh-TW       "Uninstall"
                                            #language ja-JP       "\wideなし\narrow"
                                            #language it-IT       "Uninstall"
                                            #language es-ES       "Uninstall"
                                            #language de-DE       "Uninstalliert"
                                            #language pt-PT       "Uninstalar"
#string STR_SERIAL_ATA_PORT1_SECURITY_MODE  #language en-US       "Uninstall"
                                            #language fr-FR       "Uninstalle"
                                            #language zh-TW       "Uninstall"
                                            #language ja-JP       "\wideなし\narrow"
                                            #language it-IT       "Uninstall"
                                            #language es-ES       "Uninstall"
                                            #language de-DE       "Uninstalliert"
                                            #language pt-PT       "Uninstalar"
#string STR_SERIAL_ATA_PORT2_TRANSFER_MODE  #language en-US       "Serial ATA Best Mode"
                                            #language fr-FR       "Serial ATA Best Mode"
                                            #language zh-TW       "Serial ATA Best Mode"
                                            #language ja-JP       "Serial ATA Best Mode"
                                            #language it-IT       "Serial ATA Best Mode"
                                            #language es-ES       "Serial ATA Best Mode"
                                            #language de-DE       "Serial ATA Best Mode"
                                            #language pt-PT       "Serial ATA Best Mode"
#string STR_SERIAL_ATA_PORT3_TRANSFER_MODE  #language en-US       "Serial ATA Best Mode"
                                            #language fr-FR       "Serial ATA Best Mode"
                                            #language zh-TW       "Serial ATA Best Mode"
                                            #language ja-JP       "Serial ATA Best Mode"
                                            #language it-IT       "Serial ATA Best Mode"
                                            #language es-ES       "Serial ATA Best Mode"
                                            #language de-DE       "Serial ATA Best Mode"
                                            #language pt-PT       "Serial ATA Best Mode"
#string STR_SERIAL_ATA_PORT2_SECURITY_MODE  #language en-US       "Uninstall"
                                            #language fr-FR       "Uninstalle"
                                            #language zh-TW       "Uninstall"
                                            #language ja-JP       "\wideなし\narrow"
                                            #language it-IT       "Uninstall"
                                            #language es-ES       "Uninstall"
                                            #language de-DE       "Uninstalliert"
                                            #language pt-PT       "Uninstalar"
#string STR_SERIAL_ATA_PORT3_SECURITY_MODE  #language en-US       "Uninstall"
                                            #language fr-FR       "Uninstalle"
                                            #language zh-TW       "Uninstall"
                                            #language ja-JP       "\wideなし\narrow"
                                            #language it-IT       "Uninstall"
                                            #language es-ES       "Uninstall"
                                            #language de-DE       "Uninstalliert"
                                            #language pt-PT       "Uninstalar"
#string STR_SERIAL_ATA_PORT4_TRANSFER_MODE  #language en-US       "Serial ATA Best Mode"
                                            #language fr-FR       "Serial ATA Best Mode"
                                            #language zh-TW       "Serial ATA Best Mode"
                                            #language ja-JP       "Serial ATA Best Mode"
                                            #language it-IT       "Serial ATA Best Mode"
                                            #language es-ES       "Serial ATA Best Mode"
                                            #language de-DE       "Serial ATA Best Mode"
                                            #language pt-PT       "Serial ATA Best Mode"
#string STR_SERIAL_ATA_PORT5_TRANSFER_MODE  #language en-US       "Serial ATA Best Mode"
                                            #language fr-FR       "Serial ATA Best Mode"
                                            #language zh-TW       "Serial ATA Best Mode"
                                            #language ja-JP       "Serial ATA Best Mode"
                                            #language it-IT       "Serial ATA Best Mode"
                                            #language es-ES       "Serial ATA Best Mode"
                                            #language de-DE       "Serial ATA Best Mode"
                                            #language pt-PT       "Serial ATA Best Mode"
#string STR_SERIAL_ATA_PORT4_SECURITY_MODE  #language en-US       "Uninstall"
                                            #language fr-FR       "Uninstalle"
                                            #language zh-TW       "Uninstall"
                                            #language ja-JP       "\wideなし\narrow"
                                            #language it-IT       "Uninstall"
                                            #language es-ES       "Uninstall"
                                            #language de-DE       "Uninstalliert"
                                            #language pt-PT       "Uninstalar"
#string STR_SERIAL_ATA_PORT5_SECURITY_MODE  #language en-US       "Uninstall"
                                            #language fr-FR       "Uninstalle"
                                            #language zh-TW       "Uninstall"
                                            #language ja-JP       "\wideなし\narrow"
                                            #language it-IT       "Uninstall"
                                            #language es-ES       "Uninstall"
                                            #language de-DE       "Uninstalliert"
                                            #language pt-PT       "Uninstalar"
#string STR_SERIAL_ATA_PORT6_TRANSFER_MODE  #language en-US       "Serial ATA Best Mode"
                                            #language fr-FR       "Serial ATA Best Mode"
                                            #language zh-TW       "Serial ATA Best Mode"
                                            #language ja-JP       "Serial ATA Best Mode"
                                            #language it-IT       "Serial ATA Best Mode"
                                            #language es-ES       "Serial ATA Best Mode"
                                            #language de-DE       "Serial ATA Best Mode"
                                            #language pt-PT       "Serial ATA Best Mode"
#string STR_SERIAL_ATA_PORT7_TRANSFER_MODE  #language en-US       "Serial ATA Best Mode"
                                            #language fr-FR       "Serial ATA Best Mode"
                                            #language zh-TW       "Serial ATA Best Mode"
                                            #language ja-JP       "Serial ATA Best Mode"
                                            #language it-IT       "Serial ATA Best Mode"
                                            #language es-ES       "Serial ATA Best Mode"
                                            #language de-DE       "Serial ATA Best Mode"
                                            #language pt-PT       "Serial ATA Best Mode"
#string STR_SERIAL_ATA_PORT6_SECURITY_MODE  #language en-US       "Uninstall"
                                            #language fr-FR       "Uninstalle"
                                            #language zh-TW       "Uninstall"
                                            #language ja-JP       "\wideなし\narrow"
                                            #language it-IT       "Uninstall"
                                            #language es-ES       "Uninstall"
                                            #language de-DE       "Uninstalliert"
                                            #language pt-PT       "Uninstalar"
#string STR_SERIAL_ATA_PORT7_SECURITY_MODE  #language en-US       "Uninstall"
                                            #language fr-FR       "Uninstalle"
                                            #language zh-TW       "Uninstall"
                                            #language ja-JP       "\wideなし\narrow"
                                            #language it-IT       "Uninstall"
                                            #language es-ES       "Uninstall"
                                            #language de-DE       "Uninstalliert"
                                            #language pt-PT       "Uninstalar"
#string STR_IDE_TRANSMODE_FAST_PIO          #language en-US        "Fast PIO"
                                            #language fr-FR        "Fast PIO"
                                            #language zh-TW        "Fast PIO"
                                            #language ja-JP        "Fast PIO"
                                            #language it-IT        "Fast PIO"
                                            #language es-ES        "Fast PIO"
                                            #language de-DE        "Fast PIO"
                                            #language pt-PT        "Fast PIO"
#string STR_IDE_ULTRA_DMA_ATA_33            #language en-US        "Ultra DMA ATA-33"
                                            #language fr-FR        "Ultra DMA ATA-33"
                                            #language zh-TW        "Ultra DMA ATA-33"
                                            #language ja-JP        "Ultra DMA ATA-33"
                                            #language it-IT        "Ultra DMA ATA-33"
                                            #language es-ES        "Ultra DMA ATA-33"
                                            #language de-DE        "Ultra DMA ATA-33"
                                            #language pt-PT        "Ultra DMA ATA-33"
#string STR_IDE_ULTRA_DMA_ATA_66            #language en-US        "Ultra DMA ATA-66"
                                            #language fr-FR        "Ultra DMA ATA-66"
                                            #language zh-TW        "Ultra DMA ATA-66"
                                            #language ja-JP        "Ultra DMA ATA-66"
                                            #language it-IT        "Ultra DMA ATA-66"
                                            #language es-ES        "Ultra DMA ATA-66"
                                            #language de-DE        "Ultra DMA ATA-66"
                                            #language pt-PT        "Ultra DMA ATA-66"
#string STR_IDE_ULTRA_DMA_ATA_100           #language en-US        "Ultra DMA ATA-100"
                                            #language fr-FR        "Ultra DMA ATA-100"
                                            #language zh-TW        "Ultra DMA ATA-100"
                                            #language ja-JP        "Ultra DMA ATA-100"
                                            #language it-IT        "Ultra DMA ATA-100"
                                            #language es-ES        "Ultra DMA ATA-100"
                                            #language de-DE        "Ultra DMA ATA-100"
                                            #language pt-PT        "Ultra DMA ATA-100"
#string STR_SATA0_HOTPLUG_CAP_PROMPT                  #language en-US "  SATA Port 0 Hot Plug Capability"
#string STR_SATA1_HOTPLUG_CAP_PROMPT                  #language en-US "  SATA Port 1 Hot Plug Capability"
#string STR_SATA_HOTPLUG_CAP_HELP                     #language en-US "If enabled, SATA port will be reported as Hot Plug capable."
#string STR_SATA0_CONNECTED_ODD_PROMPT                #language en-US "  SATA Port 0 Connected to an ODD"
#string STR_SATA1_CONNECTED_ODD_PROMPT                #language en-US "  SATA Port 1 Connected to an ODD"   
#string STR_SATA_CONNECTED_ODD_HELP                   #language en-US "If enabled, when SATA port connected to an ODD will enable software auto detection for media insert and tray ejection." 

#string STR_SATA_CONFIG_STRING           #language en-US        "SATA Configuration"
                                        #language fr-FR        "Configuration SATA"
                                        #language it-IT        "Configurazione SATA"
                                        #language es-ES        "Configuración SATA"
                                        #language de-DE        "SATA konfiguration"
                                        #language pt-PT        "Configuração de SATA"
#string STR_SATA_CONFIG_HELP             #language en-US        "Select the SATA controller and hard disk drive type installed in your system"
                                        #language fr-FR        "Selectionner SATA controleur et le type de lecteur de disque dur installé dans votre système."
                                        #language it-IT        "Selezionare il controller SATA e la tipologia di drive hard disk installati nel vostro sistema"
                                        #language es-ES        "Seleccione el regulador del SATA y el tipo de impulsión del disco duro instalado en su sistema."
                                        #language de-DE        "Wählen Sie den SATA-Kontroller und den Typen des Festplattenlaufwerks aus, die in Ihr System installiert sind"
                                        #language pt-PT        "Selecione o SATA controlador e disco rígido drive instalado no seu sistema"
#string STR_SATA_CTRL_STRING             #language en-US        "SATA Controller"
                                        #language fr-FR        "Configuration SATAr"
                                        #language zh-TW        "SATA \wide控制器\narrow"
                                        #language it-IT        "SATA Controller"
                                        #language es-ES        "SATA Controller"
                                        #language de-DE        "SATA Kontroller"
                                        #language pt-PT        "SATA controlador"
#string STR_SATA_CTRL_HELP               #language en-US        "DISABLED: Disables SATA Controller. ENABLED: Enables SATA Controller."
                                        #language fr-FR        "DISABLED: Disables SATA Controller. ENABLED: Enables SATA Controller."
                                        #language zh-TW        "\wide停用\narrow: \wide停用\narrowSATA\wide控制器\narrow. \wide啟用\narrow: \wide啟用\narrowSATA\wide控制器\narrow."
                                        #language it-IT        "DISABLED: Disables SATA Controller. ENABLED: Enables SATA Controller."
                                        #language es-ES        "DISABLED: Disables SATA Controller. ENABLED: Enables SATA Controller."
                                        #language de-DE        "DISABLED: Disables SATA Controller. ENABLED: Enables SATA Controller."
                                        #language pt-PT        "DISABLED: Disables SATA Controller. ENABLED: Enables SATA Controller."
#string STR_HDC_CONFIGURE_TYPE_STRING   #language en-US        "HDC Configure As"
                                        #language fr-FR        "HDC Configure As"
                                        #language zh-TW        "\wide硬碟控制設定\narrow"
                                        #language it-IT        "HDC Configure As"
                                        #language es-ES        "HDC Configure As"
                                        #language de-DE        "HDC Configure As"
                                        #language pt-PT        "HDC Configurare como"
#string STR_HDC_CONFIGURE_TYPE_HELP     #language en-US        "Set Harddisk Controller Configure Type"
                                        #language fr-FR        "Regler le type de Configuration de Controleur de Disque Dur"
                                        #language zh-TW        "\wide設定硬碟控制種類\narrow"
                                        #language it-IT        "Impostare la tipologia di configurazione del controller del disco rigido"
                                        #language es-ES        "Fije el Tipo de la Configuración del Regulador del Disco duro"
                                        #language de-DE        "Stellen Sie Festplatte Kontroller Konfiguration Typen ein"
                                        #language pt-PT        "Ajuste o Tipo de Ajuste de Controlador de Disco Rígido"

#string STR_HDC_TYPE_IDE_TEXT           #language en-US        "IDE"
                                        #language fr-FR        "IDE"
                                        #language it-IT        "IDE"
                                        #language es-ES        "IDE"
#string STR_HDC_TYPE_AHCI_TEXT          #language en-US        "AHCI"
                                        #language fr-FR        "AHCI"
                                        #language it-IT        "AHCI"
                                        #language es-ES        "AHCI"
                                        #language de-DE        "AHCI"
                                        #language pt-PT        "AHCI"
#string STR_HDC_TYPE_RAID_TEXT          #language en-US        "RAID"
                                        #language fr-FR        "RAID"
                                        #language it-IT        "RAID"
                                        #language es-ES        "RAID"
#string STR_AGGRESS_LINK_POWER_STRING   #language en-US        "AHCI/RAID SALP"
                                        #language fr-FR        "AHCI/RAID SALP"
                                        #language it-IT        "AHCI/RAID SALP"
                                        #language es-ES        "AHCI/RAID SALP"
#string STR_AGGRESS_LINK_POWER_HELP     #language en-US        "Enable/Disable AHCI/RAID Support Aggressive Link Power Management(SALP) in AHCI Host Capability Register Bit 26."
                                        #language fr-FR        "Enable/Disable AHCI/RAID Support Aggressive Link Power Management(SALP) in AHCI Host Capability Register Bit 26."
                                        #language it-IT        "Enable/Disable AHCI/RAID Support Aggressive Link Power Management(SALP) in AHCI Host Capability Register Bit 26."
                                        #language es-ES        "Enable/Disable AHCI/RAID Support Aggressive Link Power Management(SALP) in AHCI Host Capability Register Bit 26."

#string STR_AHCI_OPTION_ROM_SUPPORT_STRING  #language en-US        "AHCI Option ROM Support"
#string STR_AHCI_OPTION_ROM_SUPPORT_HELP    #language en-US        "If AHCI option ROM set disable ,the system can only detect port 0 to port 3.If AHCI option ROM set enable ,the system can detect all port."
#string STR_SATA_P0_HOT_PLUG_STRING     #language en-US        "SATA Port 0 - HotPlug"
                                        #language fr-FR        "SATA Port 0 - HotPlug"
                                        #language it-IT        "Porta SATA 0 - HotPlug"
                                        #language es-ES        "Porta SATA 0 - Enchufe Caliente"
                                        #language de-DE        "SATA Port 0 - Heißer Stecker"
                                        #language pt-PT        "Porta SATA 0 - Tomada Quente"
#string STR_SATA_P0_HOT_PLUG_HELP       #language en-US        "Enable/Disable SATA Port 0 HotPlug"
                                        #language fr-FR        "Activer/Désactiver SATA Port 0 HotPlug"
                                        #language it-IT        "Abilitare/Disabilitare Porta SATA 0 HotPlug"
                                        #language es-ES        "Permita/Inhabilite Porta SATA 0 Enchufe Caliente"
                                        #language de-DE        "Aktivieren/Sperren SATA Port 0 Heißer Stecker"
                                        #language pt-PT        "Aprovar/Desaprovar Porta SATA 0 Tomada Quente"
#string STR_SATA_P1_HOT_PLUG_STRING     #language en-US        "SATA Port 1 - HotPlug"
                                        #language fr-FR        "SATA Port 1 - HotPlug"
                                        #language it-IT        "Porta SATA 1 - HotPlug"
                                        #language es-ES        "Porta SATA 1 - Enchufe Caliente"
                                        #language de-DE        "SATA Port 1 - Heißer Stecker"
                                        #language pt-PT        "Porta SATA 1 - Tomada Quente"
#string STR_SATA_P1_HOT_PLUG_HELP       #language en-US        "Enable/Disable SATA Port 1 HotPlug"
                                        #language fr-FR        "Activer/Désactiver SATA Port 1 HotPlug"
                                        #language it-IT        "Abilitare/Disabilitare Porta SATA 1 HotPlug"
                                        #language es-ES        "Permita/Inhabilite Porta SATA 1 Enchufe Caliente"
                                        #language de-DE        "Aktivieren/Sperren SATA Port 1 Heißer Stecker"
                                        #language pt-PT        "Aprovar/Desaprovar Porta SATA 1 Tomada Quente"
#string STR_SATA_P2_HOT_PLUG_STRING     #language en-US        "SATA Port 2 - HotPlug"
                                        #language fr-FR        "SATA Port 2 - HotPlug"
                                        #language it-IT        "Porta SATA 2 - HotPlug"
                                        #language es-ES        "Porta SATA 2 - Enchufe Caliente"
                                        #language de-DE        "SATA Port 2 - Heißer Stecker"
                                        #language pt-PT        "Porta SATA 2 - Tomada Quente"
#string STR_SATA_P2_HOT_PLUG_HELP       #language en-US        "Enable/Disable SATA Port 2 HotPlug"
                                        #language fr-FR        "Activer/Désactiver SATA Port 2 HotPlug"
                                        #language it-IT        "Abilitare/Disabilitare Porta SATA 2 HotPlug"
                                        #language es-ES        "Permita/Inhabilite Porta SATA 2 Enchufe Caliente"
                                        #language de-DE        "Aktivieren/Sperren SATA Port 2 Heißer Stecker"
                                        #language pt-PT        "Aprovar/Desaprovar Porta SATA 2 Tomada Quente"
#string STR_SATA_P3_HOT_PLUG_STRING     #language en-US        "SATA Port 3 - HotPlug"
                                        #language fr-FR        "SATA Port 3 - HotPlug"
                                        #language it-IT        "Porta SATA 3 - HotPlug"
                                        #language es-ES        "Porta SATA 3 - Enchufe Caliente"
                                        #language de-DE        "SATA Port 3 - Heißer Stecker"
                                        #language pt-PT        "Porta SATA 3 - Tomada Quente"
#string STR_SATA_P3_HOT_PLUG_HELP       #language en-US        "Enable/Disable SATA Port 3 HotPlug"
                                        #language fr-FR        "Activer/Désactiver SATA Port 3 HotPlug"
                                        #language it-IT        "Abilitare/Disabilitare Porta SATA 3 HotPlug"
                                        #language es-ES        "Permita/Inhabilite Porta SATA 3 Enchufe Caliente"
                                        #language de-DE        "Aktivieren/Sperren SATA Port 3 Heißer Stecker"
                                        #language pt-PT        "Aprovar/Desaprovar Porta SATA 3 Tomada Quente"
#string STR_SATA_P4_HOT_PLUG_STRING     #language en-US        "SATA Port 4 - HotPlug"
                                        #language fr-FR        "SATA Port 4 - HotPlug"
                                        #language it-IT        "Porta SATA 4 - HotPlug"
                                        #language es-ES        "Porta SATA 4 - Enchufe Caliente"
                                        #language de-DE        "SATA Port 4 - Heißer Stecker"
                                        #language pt-PT        "Porta SATA 4 - Tomada Quente"
#string STR_SATA_P4_HOT_PLUG_HELP       #language en-US        "Enable/Disable SATA Port 4 HotPlug"
                                        #language fr-FR        "Activer/Désactiver SATA Port 4 HotPlug"
                                        #language it-IT        "Abilitare/Disabilitare Porta SATA 4 HotPlug"
                                        #language es-ES        "Permita/Inhabilite Porta SATA 4 Enchufe Caliente"
                                        #language de-DE        "Aktivieren/Sperren SATA Port 4 Heißer Stecker"
                                        #language pt-PT        "Aprovar/Desaprovar Porta SATA 4 Tomada Quente"
#string STR_SATA_P5_HOT_PLUG_STRING     #language en-US        "SATA Port 5 - HotPlug"
                                        #language fr-FR        "SATA Port 5 - HotPlug"
                                        #language it-IT        "Porta SATA 5 - HotPlug"
                                        #language es-ES        "Porta SATA 5 - Enchufe Caliente"
                                        #language de-DE        "SATA Port 5 - Heißer Stecker"
                                        #language pt-PT        "Porta SATA 5 - Tomada Quente"
#string STR_SATA_P5_HOT_PLUG_HELP       #language en-US        "Enable/Disable SATA Port 5 HotPlug"
                                        #language fr-FR        "Activer/Désactiver SATA Port 5 HotPlug"
                                        #language it-IT        "Abilitare/Disabilitare Porta SATA 5 HotPlug"
                                        #language es-ES        "Permita/Inhabilite Porta SATA 5 Enchufe Caliente"
                                        #language de-DE        "Aktivieren/Sperren SATA Port 5 Heißer Stecker"
                                        #language pt-PT        "Aprovar/Desaprovar Porta SATA 5 Tomada Quente"
#string STR_SATA_SPIN_UP_DEVICE_STRING  #language en-US        "            - Spin Up"
                                        #language fr-FR        "            - Spin Up"
                                        #language it-IT        "             - Spin Up"
                                        #language es-ES        "             - Spin Up"
                                        #language de-DE        "            - Spin Up"
                                        #language pt-PT        "             - Spin Up"
#string STR_SATA_SPIN_UP_DEVICE_HELP    #language en-US        "On an edge detect from 0 to 1, the PCH starts a COMRESET initialization sequence to the device."
                                        #language fr-FR        "On an edge detect from 0 to 1, the PCH starts a COMRESET initialization sequence to the device."
                                        #language it-IT        "On an edge detect from 0 to 1, the PCH starts a COMRESET initialization sequence to the device."
                                        #language es-ES        "On an edge detect from 0 to 1, the PCH starts a COMRESET initialization sequence to the device."
                                        #language de-DE        "On an edge detect from 0 to 1, the PCH starts a COMRESET initialization sequence to the device."
                                        #language pt-PT        "On an edge detect from 0 to 1, the PCH starts a COMRESET initialization sequence to the device."
#string STR_SATA_P0_INTER_LOCK_SWITCH_STRING    #language en-US        "SATA Port 0 ILS"
                                                #language fr-FR        "SATA Port 0 ILS"
                                                #language it-IT        "Porta SATA 0 ILS"
                                                #language es-ES        "Porta SATA 0 ILS"
                                                #language de-DE        "SATA Port 0 ILSSATA Port 0 ILS"
                                                #language pt-PT        "Porta SATA 0 ILS"
#string STR_SATA_P0_INTER_LOCK_SWITCH_HELP      #language en-US        "Enable/Disable SATA Port 0 InterLock Switch"
                                                #language fr-FR        "EActiver/Désactiver SATA Port 0 Interlock Contact"
                                                #language it-IT        "Abilitare/Disabilitare Porta SATA 0 Selettore InterLock"
                                                #language es-ES        "Permita/Inhabilite Porta SATA 0 Interruptor de Interlock"
                                                #language de-DE        "Aktivieren/Sperren SATA Port 0 Sicherheitsschalter"
                                                #language pt-PT        "Aprovar/Desaprovar Porta SATA 0 Interruptor de InterTrancar"
#string STR_SATA_P1_INTER_LOCK_SWITCH_STRING    #language en-US        "SATA Port 1 ILS"
                                                #language fr-FR        "SATA Port 1 ILS"
                                                #language it-IT        "Porta SATA 1 ILS"
                                                #language es-ES        "Porta SATA 1 ILS"
#string STR_SATA_P1_INTER_LOCK_SWITCH_HELP      #language en-US        "Enable/Disable SATA Port 1 InterLock Switch"
                                                #language fr-FR        "Enable/Disable SATA Port 1 InterLock Switch"
                                                #language it-IT        "Abilitare/Disabilitare Porta SATA 1 Selettore InterLock"
                                                #language es-ES        "Permita/Inhabilite Porta SATA 1 Interruptor de Interlock"
#string STR_SATA_P2_INTER_LOCK_SWITCH_STRING    #language en-US        "SATA Port 2 ILS"
                                                #language fr-FR        "SATA Port 2 ILS"
                                                #language it-IT        "Porta SATA 2 ILS"
                                                #language es-ES        "Permita/Inhabilite Porta SATA 0 Interruptor de Interlock"
                                                #language de-DE        "SATA Port 2 ILS"
                                                #language pt-PT        "Porta SATA 2 ILS"
#string STR_SATA_P2_INTER_LOCK_SWITCH_HELP      #language en-US        "Enable/Disable SATA Port 2 InterLock Switch"
                                                #language fr-FR        "Activer/Désactiver SATA Port 2 Interlock Contact"
                                                #language it-IT        "Abilitare/Disabilitare Porta SATA 2 Selettore InterLock"
                                                #language es-ES        "Permita/Inhabilite Porta SATA 2 Interruptor de Interlock"
                                                #language de-DE        "Aktivieren/Sperren SATA Port 2 Sicherheitsschalter"
                                                #language pt-PT        "Aprovar/Desaprovar Porta SATA 2 Interruptor de InterTrancar"
#string STR_DELAY_IDE_INITIAL_STRING    #language en-US        "Delay IDE Initial (Secs)"
                                        #language fr-FR        "Retarder IDE Initial (Secs)"
                                        #language it-IT        "Cancellazione IDE Iniziale (Secondi)"
                                        #language es-ES        "Retraso inicial de IDE (Secs)"
                                        #language de-DE        "Verzögerung IDE-Initiale (Sek)"
                                        #language pt-PT        "Atrasa IDE Inicial (Segs)"
#string STR_AHCIBOOT_STRING             #language en-US        "AHCI BOOT"
                                        #language fr-FR        "AHCI BOOT"
                                        #language it-IT        "accensione AHCI"
                                        #language es-ES        "AHCI BOOT"
                                        #language de-DE        "AHCI BOOT"
                                        #language pt-PT        "AHCI BOOT"
#string STR_AHCIBOOT_HELP               #language en-US        "Set SATA AHCI Mode Boot Enable/Disable"
                                        #language fr-FR        "Set SATA AHCI Mode Boot Enable/Disable"
                                        #language it-IT        "Set SATA AHCI Mode Boot Enable/Disable"
                                        #language es-ES        "Set SATA AHCI Mode Boot Enable/Disable"
                                        #language de-DE        "Set SATA AHCI Modus Boot Aktivieren/Sperren"
                                        #language pt-PT        "Ajuste de SATA AHCI Modo Boot Aprovar/Desaprovar"

#string STR_SATA_TEST_MODE_PROMPT                      #language en-US "SATA Test Mode"
#string STR_SATA_TEST_MODE_HELP                        #language en-US "Test Mode Enable/Disable"
#string STR_SATA_INTERFACE_SPEED_PROMPT #language en-US        "SATA Interface Speed"
//[-start-170321-IB07400848-modify]//
#string STR_SATA_INTERFACE_SPEED_HELP   #language en-US        "Select SATA Interface Speed."
//[-end-170321-IB07400848-modify]//
#string STR_GEN1_TEXT                   #language en-US        "Gen1"
#string STR_GEN2_TEXT                   #language en-US        "Gen2"
#string STR_GEN3_TEXT                   #language en-US        "Gen3"
